pmo-dataset/variations/graphviz_basic/33.dot
digraph G {
  rankdir=LR;  
  node [shape=box];

  "Send sketches to an artist" -> "Receive result";
  "Receive result" -> "Satisfied with result?";
  "Tell artist to change" -> "ExclusiveGateway_1";
  "ExclusiveGateway_1" -> "Send sketches to an artist";
  "Create a 3D model" -> "ExclusiveGateway_1";
  "Satisfied with result?" -> "Choose the color" [label="Yes"];
  "Choose the color" -> "In stock?";
  "In stock?" -> "Check color level" [label="Yes"];
  "Check color level" -> "Under 100g?";
  "Under 100g?" -> "Put it on shopping list" [label="Yes"];
  "Under 100g?" -> "ExclusiveGateway_2" [label="No"];
  "Put it on shopping list" -> "ExclusiveGateway_2";
  "In stock?" -> "Order color" [label="No"];
  "ExclusiveGateway_2" -> "ExclusiveGateway_3";
  "Order color" -> "Receive order confirmation";
  "ExclusiveGateway_3" -> "Turn on the printer";
  "Turn on the printer" -> "ParallelGateway_1";
  "ParallelGateway_1" -> "Generate gcode file";
  "Receive status" -> "Heated?";
  "ParallelGateway_1" -> "ExclusiveGateway_4";
  "ExclusiveGateway_4" -> "Receive status";
  "Heated?" -> "ParallelGateway_2" [label="Yes"];
  "Generate gcode file" -> "ParallelGateway_2";
  "ParallelGateway_2" -> "Print the model";
  "Print the model" -> "Model printed";
  "Heated?" -> "ExclusiveGateway_4" [label="No"];
  "Receive order confirmation" -> "Color received";
  "Color received" -> "ExclusiveGateway_3";
  "Satisfied with result?" -> "Tell artist to change" [label="No"];

  "Create a 3D model" [shape=circle, label="Create a 3D model"];
  "Model printed" [shape=circle, label="Model printed"];
  "Satisfied with result?" [shape=diamond];
  "ExclusiveGateway_1" [shape=diamond, label="X"];
  "In stock?" [shape=diamond];
  "Under 100g?" [shape=diamond];
  "ExclusiveGateway_2" [shape=diamond, label="X"];
  "ExclusiveGateway_3" [shape=diamond, label="X"];
  "Heated?" [shape=diamond];
  "ExclusiveGateway_4" [shape=diamond, label="X"];
  "ParallelGateway_1" [shape=diamond, label="+"];
  "ParallelGateway_2" [shape=diamond, label="+"];
}
