pmo-dataset/variations/mermaid_with_ids/33.mmd
graph LR
	classDef endEvent stroke-width:3px
	User_1["Send sketches to an\nartist"]
	User_2["Tell artist to\nchange"]
	User_3["Choose the color"]
	User_4["Check color level"]
	User_5["Order color"]
	User_6["Turn on the printer"]
	User_7["Generate gcode file"]
	User_8["Print the model"]
	Receive_1["Receive result"]
	Receive_2["Receive status"]
	Receive_3["Receive order\nconfirmation"]
	Manual_1["Put it on shopping\nlist"]
	Manual_2["Color received"]
	StartNoneEvent_1(("Create a 3D model"))
	EndNoneEvent_1(("Model printed")):::endEvent
	ExclusiveGateway_1{"Satisfied with\nresult?"}
	ExclusiveGateway_2{"X"}
	ExclusiveGateway_3{"In stock?"}
	ExclusiveGateway_4{"Under 100g?"}
	ExclusiveGateway_5{"X"}
	ExclusiveGateway_6{"X"}
	ExclusiveGateway_7{"Heated?"}
	ExclusiveGateway_8{"X"}
	ParallelGateway_1{"+"}
	ParallelGateway_2{"+"}

	User_1 --> Receive_1
	Receive_1 --> ExclusiveGateway_1
	User_2 --> ExclusiveGateway_2
	ExclusiveGateway_2 --> User_1
	StartNoneEvent_1 --> ExclusiveGateway_2
	ExclusiveGateway_1 -->|"Yes"| User_3
	User_3 --> ExclusiveGateway_3
	ExclusiveGateway_3 -->|"Yes"| User_4
	User_4 --> ExclusiveGateway_4
	ExclusiveGateway_4 -->|"Yes"| Manual_1
	ExclusiveGateway_4 -->|"No"| ExclusiveGateway_5
	Manual_1 --> ExclusiveGateway_5
	ExclusiveGateway_3 -->|"No"| User_5
	ExclusiveGateway_5 --> ExclusiveGateway_6
	User_5 --> Receive_3
	ExclusiveGateway_6 --> User_6
	User_6 --> ParallelGateway_1
	ParallelGateway_1 --> User_7
	Receive_2 --> ExclusiveGateway_7
	ParallelGateway_1 --> ExclusiveGateway_8
	ExclusiveGateway_8 --> Receive_2
	ExclusiveGateway_7 -->|"Yes"| ParallelGateway_2
	User_7 --> ParallelGateway_2
	ParallelGateway_2 --> User_8
	User_8 --> EndNoneEvent_1
	ExclusiveGateway_7 -->|"No"| ExclusiveGateway_8
	Receive_3 --> Manual_2
	Manual_2 --> ExclusiveGateway_6
	ExclusiveGateway_1 -->|"No"| User_2
